In [1]:
import numpy as np
import pandas as pd 
from pandas import Series, DataFrame

In [2]:
#Let's make a dframe
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

#Show
dframe

   dataset1  dataset2 k1     k2
0  0.184082 -0.950471  X  alpha
1 -0.546236  0.094235  X   beta
2 -0.275166  0.742671  Y  alpha
3  0.478387 -1.541560  Y   beta
4  0.144514  0.845008  Z  alpha

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X   -0.181077
Y    0.101611
Z    0.144514
Name: dataset1, dtype: float64

In [7]:
# We can use group keys that are series as well

#For example:

#We'll make some arrays for use as keys
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

#Now using the data from dataset1, group the means by city and month
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.546236
    JAN   -0.275166
NY  FEB    0.478387
    JAN    0.164298
Name: dataset1, dtype: float64

In [8]:
dframe

   dataset1  dataset2 k1     k2
0  0.184082 -0.950471  X  alpha
1 -0.546236  0.094235  X   beta
2 -0.275166  0.742671  Y  alpha
3  0.478387 -1.541560  Y   beta
4  0.144514  0.845008  Z  alpha

In [9]:


# WE can also pass column names as group keys
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.181077 -0.428118
Y   0.101611 -0.399445
Z   0.144514  0.845008

In [10]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.184082 -0.950471
   beta  -0.546236  0.094235
Y  alpha -0.275166  0.742671
   beta   0.478387 -1.541560
Z  alpha  0.144514  0.845008

In [11]:
dframe.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [12]:
for name,group in dframe.groupby('k1'):
    print "This is the %s group" %name
    print group
    print "\n"

This is the X group
   dataset1  dataset2 k1     k2
0  0.184082 -0.950471  X  alpha
1 -0.546236  0.094235  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -0.275166  0.742671  Y  alpha
3  0.478387 -1.541560  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.144514  0.845008  Z  alpha

In [13]:
print group1

<pandas.core.groupby.SeriesGroupBy object at 0x000000000C55AEF0>

In [14]:
# We can also iterate with multiple keys
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print "Key1 = %s Key2 = %s" %(k1,k2)
    print group
    print '\n'

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2
0  0.184082 -0.950471  X  alpha


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2
1 -0.546236  0.094235  X  beta


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2
2 -0.275166  0.742671  Y  alpha


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2
3  0.478387  -1.54156  Y  beta


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2
4  0.144514  0.845008  Z  alpha

In [15]:
# A possibly useful tactic is creating a dictionary of the data pieces 
group_dict = dict(list(dframe.groupby('k1')))

#Show the group with X
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.184082 -0.950471  X  alpha
1 -0.546236  0.094235  X   beta

In [16]:
# We could have also chosen to do this with axis = 1

# Let's creat a dictionary for dtypes of objects!
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

#show
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.184082 -0.950471
 1 -0.546236  0.094235
 2 -0.275166  0.742671
 3  0.478387 -1.541560
 4  0.144514  0.845008, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [17]:
# For example if we only wanted to group the dataset2 column with both sets of keys
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.950471
   beta   0.094235
Y  alpha  0.742671
   beta  -1.541560
Z  alpha  0.845008